# OriginalFontName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontKey..::..OriginalFontName Property
ExportFontKey Class See Also
---
The original font name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public string OriginalFontName { get; set; }
```

Visual Basic
---
```text
Public Property OriginalFontName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ OriginalFontName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ExportFontKey Class
Autodesk.Revit.DB Namespace